[net]
batch=1
subdivisions=1
height=320
width=448
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.01
burn_in=1000
max_batches = 150000
policy=steps
steps=5000,10000,20000,30000,40000
scales=0.5,0.5,0.5,0.5,0.5

[convolutional]
batch_normalize=1
filters=15
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=30
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=60
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=100
size=3
stride=1
pad=1
activation=relu

[convolutional]
batch_normalize=1
filters=50
size=1
stride=1
pad=1
activation=relu

[convolutional]
batch_normalize=1
filters=100
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=relu

[convolutional]
batch_normalize=1
filters=80
size=1
stride=1
pad=1
activation=relu

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=260
size=3
stride=1
pad=1
activation=relu

[convolutional]
batch_normalize=1
filters=130
size=1
stride=1
pad=1
activation=relu

[convolutional]
batch_normalize=1
filters=260
size=3
stride=1
pad=1
activation=relu

[convolutional]
batch_normalize=0
size=1
stride=1
pad=1
filters=60
activation=linear

[region]
##0.15,0.15, 0.25,0.25, 0.38,0.38, 0.55,0.55, 0.75,0.75
#0.15,0.15, 0.3,0.3, 0.45,0.45, 0.6,0.6, 0.75,0.75
#anchors = 1.05,0.75, 2.1,1.5, 3.15,2.25, 4.2,3, 5.25,3.75
##anchors = 2.1,1.5, 4.2,3, 6.3,4.5, 8.4,6, 10.5,7.5

#0.3,0.45, 0.13,0.16, 0.2,0.2, 0.57,0.67, 0.42,0.58
#anchors = 4.46,4.66, 1.89,1.67, 2.88,2.96, 8.03,6.76, 5.85,5.82

anchors =0.4,0.39, 0.79,0.71, 1.3,1.2, 2.0,1.9, 2.99,2.97,  2.1,1.5, 4.2,3, 6.3,4.5, 8.4,6, 10.5,7.5

bias_match=1
classes=1
coords=4
num=10
softmax=1
jitter=.3
rescore=0

object_scale=5
noobject_scale=1
class_scale=0
coord_scale=5

absolute=1
thresh = .6
random=0
