[net]
# Testing
# batch=1
# subdivisions=1
# Training
batch=64
subdivisions=2
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
burn_in=1000
max_batches = 40000
policy=steps
steps=10000,20000,30000
scales=.1,.1,.1

[convolutional]
batch_normalize=1
filters=15
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=30
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=60
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=100
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=50
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=100
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=80
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=260
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=130
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=260
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=30
activation=linear

[region]
anchors = 2.6612,2.2592, 4.6751,6.1521, 6.0023,7.6753, 10.6042,6.8028, 8.0914,9.2994
bias_match=1
classes=1
coords=4
num=5
softmax=1
jitter=.2
rescore=0
#focal_loss=1

object_scale=5
noobject_scale=1
class_scale=1
coord_scale=1

absolute=1
thresh = .6
random=1
